app/controllers/downloads_controller.rb

SELECT "downloads".* FROM "downloads" LIMIT 12
---
  def index
    @downloads = Download.all(:limit => 12)

SELECT "downloads".* FROM "downloads" WHERE "downloads"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @download = Download.find(params[:id])

INSERT INTO "downloads" ("created_at", "download_url", "name", "thumbnail_url", "updated_at", "youtube_url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Mon, 19 Nov 2012 17:04:05 UTC +00:00], ["download_url", nil], ["name", nil], ["thumbnail_url", nil], ["updated_at", Mon, 19 Nov 2012 17:04:05 UTC +00:00], ["youtube_url", nil]]
---
  def create
    @download = Download.new(params[:download])

    torrent_url = Pirate.new.initialize_download @download
    if (torrent_url)
      torrent_url_match = torrent_url.match(/http:\/\/torrents.thepiratebay.se\/\d+\/(.*)/)
      if(torrent_url_match)
        torrent_name = torrent_url_match[1]
        session[:message] = "Download Started (filename is #{torrent_name})"
      else
        session[:message] = "Download Started (filename unknown)"
      end
    else
      session[:error] = "No results were found at the downloading sites."
    end

    respond_to do |format|
      if @download.save